# Урок 3 Задание 1
# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите два варианта решения: через list и через dict.

lst_year = [(1, "Зима"),
            (2, "Зима"),
            (3, "Весна"),
            (4, "Весна"),
            (5, "Весна"),
            (6, "Лето"),
            (7, "Лето"),
            (8, "Лето"),
            (9, "Осень"),
            (10, "Осень"),
            (11, "Осень"),
            (12, "Зима")]
dct_year = {1: "Зима",
            2: "Зима",
            3: "Весна",
            4: "Весна",
            5: "Весна",
            6: "Лето",
            7: "Лето",
            8: "Лето",
            9: "Осень",
            10: "Осень",
            11: "Осень",
            12: "Зима"}

month = int(input("Введите номер месяца: "))

for el in range(len(lst_year)):
    if (lst_year[el][0] == month):
        print(f"Результат через список: {lst_year[el][1]}")

print(f"Результат через словарь: {dct_year[month]}")
