# Задание 1.

# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

name = input("Введите Ваше имя: ")
pas_word = input("Введите пароль: ")
age = input("Введите Ваш возраст: ")

print(f"Ваши данные для входа в аккаунт: ")
print(f"Имя: {name}")
print(f"Пароль: {pas_word}")
print(f"Возраст: {age}")
